### BDD-специфікація вимог користувача
+ Feature: Перегляд можливих варіантів освітлення
+ As a клієнтка цього інтернет-магазину
+ I want to мати можливість швидко знаходити потрібний товар .
+ In order to була можливість детальніше дізнатися інформацію про певний товар
+ Scenario 1: при додаванні товарів в кошик мені пропонуються товари зі схожими характеристиками
+ Given клієнт робить замовлення
+ And обирає товари певної категорії.
+ When товари вже додані до кошика
+ Then клієнт має змогу бачити товари з схожими характеристиками.

+ Scenario 2: товари можна обрати за певними категоріями
+ Given клієнт обирає певний товар
+ And хоче швидко обрати потрібний товар
+ When коли тільки зайшли на сайт
+ Then він має змогу сортувати товар за будь-якою характеристикою
