Feature: використання додатку для співу
As a користувачка цього додатку
I want to мати можливість швидко знаходити певну категорію пісні 
In order to була можливість підтримувати психологічно-емоціональний стан за допомогою цього додатку
Scenario 1: в додатку є можливість вибору заздалегідь заготовлених категорій пісень на головній сторінці додатку
Given користувачка відкриває додаток
And хоче обрати категорію пісні.
When використовує цей додаток і має потребу підтримати свій психологічно-емоціональний стан
Then користувачка має змогу серед категорій тематики пісень швидко обрати потрібну

Scenario 2: можна власноруч ввести в пошуковій строкі потрібну тематику пісні
Given користувачка використовує додаток
And хоче швидко знайти потрібну тематику пісні
When коли перебуває на будь-якій сторінці додатку
Then  має можливість в пошуковій строкі власноруч ввести потрібну тематику пісні

