Feature: Пошук людей на Online-платформах
As a користувачка цієї Online-платформи
I want to мати можливість знаходити інших користувачів цієї платформи
In order to була можливість спілкуватися на потрібні мені теми
Scenario 1: при авторизації на платформі є можливість вказати тематику спілкування
Given користувач авторизується на платформі
And вказує свої хобі та інтереси при авторизації
When всі дані вказано
Then користувач має змогу побачити підбірку акаунтів зі схожими інтересами
Scenario 2: можна змінити тематику спілкування в будь-який момент
Given користувач уже зареєстрований на платформі
And хоче змінити тематику спілкування, свої інтереси та хобі
When коли користувач перебуває на сайті та в нього з'являться бажання змінити тематику спілкування
Then він має можливість в налаштуваннях свого акаунту змінити цю інформацію
